CCABN/CCABN-Firmware/sdkconfig.defaults
# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"

# WiFi Configuration
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_SW_COEXIST_ENABLE=y

# HTTP Server Configuration
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024

# Camera Configuration (for future use)
CONFIG_CAMERA_MODULE_ESP_EYE=n
CONFIG_CAMERA_MODULE_ESP32_CAM_BOARD=n
CONFIG_CAMERA_MODULE_CUSTOM=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y